In [1]:
import numpy as np
import pandas as pd

## Series

In [2]:
myDictionary = {"Sena":50,"Emre":40,"Büşra":42}

In [3]:
myDictionary

{'Sena': 50, 'Emre': 40, 'Büşra': 42}

In [4]:
pd.Series(myDictionary)

Sena     50
Emre     40
Büşra    42
dtype: int64

In [5]:
ages= [50,40,42]
names=["Sena","Emre","Büşra"]

In [6]:
pd.Series(ages)

0    50
1    40
2    42
dtype: int64

In [7]:
pd.Series(ages,names)

Sena     50
Emre     40
Büşra    42
dtype: int64

In [8]:
pd.Series(data = ages, index= names)

Sena     50
Emre     40
Büşra    42
dtype: int64

In [9]:
numpyArray = np.array(ages)

In [10]:
pd.Series(ages)

0    50
1    40
2    42
dtype: int64

In [11]:
pd.Series(numpyArray,names)

Sena     50
Emre     40
Büşra    42
dtype: int32

In [12]:
pd.Series(["Ceyda","Burak","Sude"],[1,2,3])

1    Ceyda
2    Burak
3     Sude
dtype: object

In [13]:
competitionResult1 = pd.Series([10,5,1],["Ceyda","Burak","Sude"])

In [14]:
competitionResult1

Ceyda    10
Burak     5
Sude      1
dtype: int64

In [15]:
competitionResult2 = pd.Series([20,10,8],["Ceyda","Burak","Sude"])

In [16]:
competitionResult2

Ceyda    20
Burak    10
Sude      8
dtype: int64

In [17]:
lastResult = competitionResult1 + competitionResult2

In [18]:
lastResult

Ceyda    30
Burak    15
Sude      9
dtype: int64

In [19]:
dfSeries = pd.Series([20,30,40,50],["a","b","c","d"])

In [20]:
dfSeries2= pd.Series([0,5,3,1],["a","c","f","g"])

In [21]:
dfSeries + dfSeries2

a    20.0
b     NaN
c    45.0
d     NaN
f     NaN
g     NaN
dtype: float64

## Data Frame

In [22]:
data = np.random.randn(4,3)

In [23]:
data

array([[-2.35902292, -0.14625322, -1.03645295],
       [-0.46288258, -0.34742266, -0.4200974 ],
       [ 1.13673164, -0.94537243,  1.57757248],
       [ 1.42135583,  0.77414031, -0.29441586]])

In [24]:
dataFrame = pd.DataFrame(data)

In [25]:
dataFrame

          0         1         2
0 -2.359023 -0.146253 -1.036453
1 -0.462883 -0.347423 -0.420097
2  1.136732 -0.945372  1.577572
3  1.421356  0.774140 -0.294416

In [26]:
newDataFrame = pd.DataFrame(data,index =["Sena","Emre","Büşra","Ceyda"],columns=["Age","Salary","Working Hours"])

In [27]:
newDataFrame

            Age    Salary  Working Hours
Sena  -2.359023 -0.146253      -1.036453
Emre  -0.462883 -0.347423      -0.420097
Büşra  1.136732 -0.945372       1.577572
Ceyda  1.421356  0.774140      -0.294416

In [28]:
newDataFrame["Age"]

Sena    -2.359023
Emre    -0.462883
Büşra    1.136732
Ceyda    1.421356
Name: Age, dtype: float64

In [29]:
newDataFrame.loc["Sena"]

Age             -2.359023
Salary          -0.146253
Working Hours   -1.036453
Name: Sena, dtype: float64

In [30]:
newDataFrame.iloc[1]

Age             -0.462883
Salary          -0.347423
Working Hours   -0.420097
Name: Emre, dtype: float64

In [31]:
newDataFrame["Retiring Age"] = newDataFrame["Age"] + newDataFrame["Age"]

In [32]:
newDataFrame

            Age    Salary  Working Hours  Retiring Age
Sena  -2.359023 -0.146253      -1.036453     -4.718046
Emre  -0.462883 -0.347423      -0.420097     -0.925765
Büşra  1.136732 -0.945372       1.577572      2.273463
Ceyda  1.421356  0.774140      -0.294416      2.842712

In [33]:
newDataFrame.drop("Retiring Age",axis=1)

            Age    Salary  Working Hours
Sena  -2.359023 -0.146253      -1.036453
Emre  -0.462883 -0.347423      -0.420097
Büşra  1.136732 -0.945372       1.577572
Ceyda  1.421356  0.774140      -0.294416

In [34]:
newDataFrame.drop("Ceyda",axis=0)

            Age    Salary  Working Hours  Retiring Age
Sena  -2.359023 -0.146253      -1.036453     -4.718046
Emre  -0.462883 -0.347423      -0.420097     -0.925765
Büşra  1.136732 -0.945372       1.577572      2.273463

In [35]:
newDataFrame

            Age    Salary  Working Hours  Retiring Age
Sena  -2.359023 -0.146253      -1.036453     -4.718046
Emre  -0.462883 -0.347423      -0.420097     -0.925765
Büşra  1.136732 -0.945372       1.577572      2.273463
Ceyda  1.421356  0.774140      -0.294416      2.842712

In [36]:
newDataFrame.drop("Retiring Age",axis=1,inplace=True)

In [37]:
newDataFrame

            Age    Salary  Working Hours
Sena  -2.359023 -0.146253      -1.036453
Emre  -0.462883 -0.347423      -0.420097
Büşra  1.136732 -0.945372       1.577572
Ceyda  1.421356  0.774140      -0.294416

In [38]:
booleanFrame = newDataFrame < 0

In [39]:
booleanFrame

         Age  Salary  Working Hours
Sena    True    True           True
Emre    True    True           True
Büşra  False    True          False
Ceyda  False   False           True

In [40]:
newDataFrame[booleanFrame]

            Age    Salary  Working Hours
Sena  -2.359023 -0.146253      -1.036453
Emre  -0.462883 -0.347423      -0.420097
Büşra       NaN -0.945372            NaN
Ceyda       NaN       NaN      -0.294416

In [41]:
newDataFrame

            Age    Salary  Working Hours
Sena  -2.359023 -0.146253      -1.036453
Emre  -0.462883 -0.347423      -0.420097
Büşra  1.136732 -0.945372       1.577572
Ceyda  1.421356  0.774140      -0.294416

In [42]:
newDataFrame[newDataFrame < 0]

            Age    Salary  Working Hours
Sena  -2.359023 -0.146253      -1.036453
Emre  -0.462883 -0.347423      -0.420097
Büşra       NaN -0.945372            NaN
Ceyda       NaN       NaN      -0.294416

In [43]:
newDataFrame[newDataFrame["Age"] > -1]

            Age    Salary  Working Hours
Emre  -0.462883 -0.347423      -0.420097
Büşra  1.136732 -0.945372       1.577572
Ceyda  1.421356  0.774140      -0.294416

In [44]:
newIndex = ["s","e","b","c"]

In [45]:
newDataFrame["New Index"] = newIndex

In [46]:
newDataFrame

            Age    Salary  Working Hours New Index
Sena  -2.359023 -0.146253      -1.036453         s
Emre  -0.462883 -0.347423      -0.420097         e
Büşra  1.136732 -0.945372       1.577572         b
Ceyda  1.421356  0.774140      -0.294416         c

In [47]:
newDataFrame.set_index("New Index")

                Age    Salary  Working Hours
New Index
s         -2.359023 -0.146253      -1.036453
e         -0.462883 -0.347423      -0.420097
b          1.136732 -0.945372       1.577572
c          1.421356  0.774140      -0.294416

In [48]:
newDataFrame

            Age    Salary  Working Hours New Index
Sena  -2.359023 -0.146253      -1.036453         s
Emre  -0.462883 -0.347423      -0.420097         e
Büşra  1.136732 -0.945372       1.577572         b
Ceyda  1.421356  0.774140      -0.294416         c

In [49]:
newDataFrame.set_index("New Index",inplace=True)

In [50]:
newDataFrame

                Age    Salary  Working Hours
New Index
s         -2.359023 -0.146253      -1.036453
e         -0.462883 -0.347423      -0.420097
b          1.136732 -0.945372       1.577572
c          1.421356  0.774140      -0.294416

In [51]:
newDataFrame.loc["s"]

Age             -2.359023
Salary          -0.146253
Working Hours   -1.036453
Name: s, dtype: float64

## Multi Index

In [52]:
firstindex = ["Simpson","Simpson","Simpson","South Park","South Park","South Park"]

In [53]:
innerindex = ["Homer","Bart","Marge","Cartman","Kenny","Kyle"]

In [54]:
unitedindex = list(zip(firstindex,innerindex))

In [55]:
unitedindex

[('Simpson', 'Homer'),
 ('Simpson', 'Bart'),
 ('Simpson', 'Marge'),
 ('South Park', 'Cartman'),
 ('South Park', 'Kenny'),
 ('South Park', 'Kyle')]

In [56]:
unitedindex = pd.MultiIndex.from_tuples(unitedindex)

In [57]:
unitedindex

MultiIndex([(   'Simpson',   'Homer'),
            (   'Simpson',    'Bart'),
            (   'Simpson',   'Marge'),
            ('South Park', 'Cartman'),
            ('South Park',   'Kenny'),
            ('South Park',    'Kyle')],
           )

In [58]:
unitedindex

MultiIndex([(   'Simpson',   'Homer'),
            (   'Simpson',    'Bart'),
            (   'Simpson',   'Marge'),
            ('South Park', 'Cartman'),
            ('South Park',   'Kenny'),
            ('South Park',    'Kyle')],
           )

In [59]:
myCartoonList = [[40,"A"],[10,"B"],[30,"C"],[90,"D"],[10,"E"],[11,"F"]]

In [60]:
cartoonDataFrame = pd.DataFrame(myCartoonList,index = unitedindex,columns=["Age","Job"])

In [61]:
cartoonDataFrame

                    Age Job
Simpson    Homer     40   A
           Bart      10   B
           Marge     30   C
South Park Cartman   90   D
           Kenny     10   E
           Kyle      11   F

In [62]:
cartoonDataFrame.loc["Simpson"]

       Age Job
Homer   40   A
Bart    10   B
Marge   30   C

In [63]:
cartoonDataFrame.loc["South Park"].loc["Kenny"]

Age    10
Job     E
Name: Kenny, dtype: object

In [64]:
cartoonDataFrame

                    Age Job
Simpson    Homer     40   A
           Bart      10   B
           Marge     30   C
South Park Cartman   90   D
           Kenny     10   E
           Kyle      11   F

In [65]:
cartoonDataFrame.index.names = ["Cartoon Name","Character Name"]

In [66]:
cartoonDataFrame

                             Age Job
Cartoon Name Character Name
Simpson      Homer            40   A
             Bart             10   B
             Marge            30   C
South Park   Cartman          90   D
             Kenny            10   E
             Kyle             11   F

## Missing Data

In [67]:
dictionaryData= {"Istanbul": [30,29,np.nan],"Ankara" : [20,np.nan,25],"Izmir":[40,39,38]}

In [68]:
weatherForecastData= pd.DataFrame(dictionaryData)

In [69]:
weatherForecastData

   Istanbul  Ankara  Izmir
0      30.0    20.0     40
1      29.0     NaN     39
2       NaN    25.0     38

In [70]:
weatherForecastData.dropna()

   Istanbul  Ankara  Izmir
0      30.0    20.0     40

In [71]:
weatherForecastData.dropna(axis=1)

   Izmir
0     40
1     39
2     38

In [72]:
newDicData= {"Istanbul": [30,29,np.nan],"Ankara" : [20,np.nan,25],"Izmir":[40,39,38],"Antalya":[45,np.nan,np.nan]}

In [73]:
newDicData = pd.DataFrame(newDicData)

In [74]:
newDicData

   Istanbul  Ankara  Izmir  Antalya
0      30.0    20.0     40     45.0
1      29.0     NaN     39      NaN
2       NaN    25.0     38      NaN

In [75]:
newDicData.dropna(axis=1,thresh=2)

   Istanbul  Ankara  Izmir
0      30.0    20.0     40
1      29.0     NaN     39
2       NaN    25.0     38

In [76]:
newDicData

   Istanbul  Ankara  Izmir  Antalya
0      30.0    20.0     40     45.0
1      29.0     NaN     39      NaN
2       NaN    25.0     38      NaN

In [77]:
newDicData.fillna(20)

   Istanbul  Ankara  Izmir  Antalya
0      30.0    20.0     40     45.0
1      29.0    20.0     39     20.0
2      20.0    25.0     38     20.0

## Groupby

In [78]:
salaryDictionary = {"Department":["Software","Software","Finance","Finance","Law","Law"],"Employee Name":["Ceyda","Mehmet","Sena","Emre","Büşra","Tahsin"],"Salary":[100,150,200,300,400,500]}

In [79]:
salaryDictionary = pd.DataFrame(salaryDictionary)

In [80]:
salaryDictionary

  Department Employee Name  Salary
0   Software         Ceyda     100
1   Software        Mehmet     150
2    Finance          Sena     200
3    Finance          Emre     300
4        Law         Büşra     400
5        Law        Tahsin     500

In [81]:
groupObject = salaryDictionary.groupby("Department")

In [82]:
groupObject

In [83]:
groupObject.count()

            Employee Name  Salary
Department
Finance                 2       2
Law                     2       2
Software                2       2

In [84]:
groupObject.mean("Salary")

            Salary
Department
Finance      250.0
Law          450.0
Software     125.0

In [85]:
groupObject.min()

           Employee Name  Salary
Department
Finance             Emre     200
Law                Büşra     400
Software           Ceyda     100

In [86]:
groupObject.max()

           Employee Name  Salary
Department
Finance             Sena     300
Law               Tahsin     500
Software          Mehmet     150

In [87]:
groupObject.describe()

           Salary
            count   mean        std    min    25%    50%    75%    max
Department
Finance       2.0  250.0  70.710678  200.0  225.0  250.0  275.0  300.0
Law           2.0  450.0  70.710678  400.0  425.0  450.0  475.0  500.0
Software      2.0  125.0  35.355339  100.0  112.5  125.0  137.5  150.0

## Concat

In [88]:
dic1 = {"Name": ["Ceyda","Mehmet","Sena"],
        "Sport":["Swimming","Running","Hike"],
        "Calorie":[100,400,300]
       }

In [89]:
dataFrame1 = pd.DataFrame(dic1,index=[0,1,2])

In [90]:
dic2 = {"Name": ["Emre","Büşra","Tahsin"],
        "Sport":["Tenis","Volleyball","Badminton"],
        "Calorie":[250,650,400]
       }

In [91]:
dataFrame2 = pd.DataFrame(dic2,index=[3,4,5])

In [92]:
dic3 = {"Name": ["Kerem","Olcay","Buket"],
        "Sport":["Hike","Football","Badminton"],
        "Calorie":[350,550,100]
       }

In [93]:
dataFrame3 = pd.DataFrame(dic3,index=[6,7,8])

In [94]:
dataFrame1

     Name     Sport  Calorie
0   Ceyda  Swimming      100
1  Mehmet   Running      400
2    Sena      Hike      300

In [95]:
dataFrame2

     Name       Sport  Calorie
3    Emre       Tenis      250
4   Büşra  Volleyball      650
5  Tahsin   Badminton      400

In [96]:
dataFrame3

    Name      Sport  Calorie
6  Kerem       Hike      350
7  Olcay   Football      550
8  Buket  Badminton      100

## Concatenation

In [97]:
pd.concat([dataFrame1,dataFrame2,dataFrame3])

     Name       Sport  Calorie
0   Ceyda    Swimming      100
1  Mehmet     Running      400
2    Sena        Hike      300
3    Emre       Tenis      250
4   Büşra  Volleyball      650
5  Tahsin   Badminton      400
6   Kerem        Hike      350
7   Olcay    Football      550
8   Buket   Badminton      100

## Merge

In [98]:
mergeDic1 = {"Name": ["Ceyda","Mehmet","Sena"],
        "Sport":["Swimming","Running","Hike"]
       }

In [99]:
mergeDic2 =  {"Name": ["Ceyda","Mehmet","Sena"],
        "Calorie":[100,400,300]
       }

In [100]:
mergeDic1 = pd.DataFrame(mergeDic1)
mergeDic2 = pd.DataFrame(mergeDic2)

In [101]:
mergeDic1

     Name     Sport
0   Ceyda  Swimming
1  Mehmet   Running
2    Sena      Hike

In [102]:
mergeDic2

     Name  Calorie
0   Ceyda      100
1  Mehmet      400
2    Sena      300

In [104]:
pd.merge(mergeDic1,mergeDic2,on="Name")

     Name     Sport  Calorie
0   Ceyda  Swimming      100
1  Mehmet   Running      400
2    Sena      Hike      300

## Advanced Topics

In [105]:
salaryDic = {"Employee Name":["Ceyda","Mehmet","Sena","Emre"],
                    "Department":["Software","Software","Finance","Law"],
                    "Salary":[100,150,200,300]}

In [106]:
salaryDataFrame = pd.DataFrame(salaryDic)

In [107]:
salaryDataFrame

  Employee Name Department  Salary
0         Ceyda   Software     100
1        Mehmet   Software     150
2          Sena    Finance     200
3          Emre        Law     300

In [109]:
salaryDataFrame["Department"].unique()

array(['Software', 'Finance', 'Law'], dtype=object)

In [110]:
salaryDataFrame["Department"].value_counts()

Department
Software    2
Finance     1
Law         1
Name: count, dtype: int64

In [112]:
def func(salary):
    return salary * 0.60

In [113]:
salaryDataFrame["Salary"].apply(func)

0     60.0
1     90.0
2    120.0
3    180.0
Name: Salary, dtype: float64

In [119]:
newData = {"Cartoon": ["South Park","South Park","Simpson","Simpson","Simpson"],
           "Name" : ["Cartman","Kenny","Homer","Bart","Bart"],
           "Age" : [9,10,50,20,30]
          }

In [120]:
cartoonDataFrame= pd.DataFrame(newData)

In [121]:
cartoonDataFrame

      Cartoon     Name  Age
0  South Park  Cartman    9
1  South Park    Kenny   10
2     Simpson    Homer   50
3     Simpson     Bart   20
4     Simpson     Bart   30

In [123]:
cartoonDataFrame.pivot_table(values="Age",index=["Cartoon","Name"],aggfunc = np.sum)

                    Age
Cartoon    Name
Simpson    Bart      50
           Homer     50
South Park Cartman    9
           Kenny     10

## Excel

In [126]:
excelData = pd.read_excel("pandas.xlsx")

In [127]:
excelData

  Unnamed: 0  Salary   Age Department
0       Sena     100  40.0   Software
1     Zeymep     150  50.0  Marketing
2     Mehmet     200  30.0        NaN
3      Ahmet      50  10.0  Marketing
4      Atlas     150   NaN    Finance
5      Fulya     200  25.0        Law

In [130]:
nonNanExcel = excelData.dropna()

In [132]:
nonNanExcel

  Unnamed: 0  Salary   Age Department
0       Sena     100  40.0   Software
1     Zeymep     150  50.0  Marketing
3      Ahmet      50  10.0  Marketing
5      Fulya     200  25.0        Law

In [133]:
nonNanExcel.to_excel("newpandas.xlsx")

## read_csv
## to_csv